Repository: ayo-eyo/LiftLog
Catalog: LiftLog/Catalog/ExerciseNames.xcstrings
Source language: en
Languages: ru

source: 3/4 Sit-Up
ru: Подъём корпуса на 3/4

source: 90/90 Hamstring
ru: Растяжка бицепса бедра 90/90

source: Ab Crunch Machine
ru: Скручивания в тренажёре

source: Ab Roller
ru: Ролик для пресса

source: Adductor
ru: Растяжка приводящих мышц

source: Adductor/Groin
ru: Растяжка приводящих мышц и паха

source: Advanced Kettlebell Windmill
ru: Мельница с гирей, продвинутая

source: Air Bike
ru: Велотренажёр с ручками (Air Bike)

source: All Fours Quad Stretch
ru: Растяжка квадрицепса на четвереньках

source: Alternate Hammer Curl
ru: Попеременные сгибания «молот»

source: Alternate Heel Touchers
ru: Попеременные касания пяток

source: Alternate Incline Dumbbell Curl
ru: Попеременные сгибания с гантелями на наклонной скамье

source: Alternate Leg Diagonal Bound
ru: Диагональные прыжки с ноги на ногу

source: Alternating Cable Shoulder Press
ru: Попеременный жим в кроссовере

source: Alternating Deltoid Raise
ru: Попеременные подъёмы на дельты

source: Alternating Floor Press
ru: Попеременный жим с пола

source: Alternating Hang Clean
ru: Попеременное взятие на грудь с виса

source: Alternating Kettlebell Press
ru: Попеременный жим гирь

source: Alternating Kettlebell Row
ru: Попеременная тяга гири

source: Alternating Renegade Row
ru: Попеременная тяга «ренегат»

source: Ankle Circles
ru: Вращения стопой

source: Ankle On The Knee
ru: Растяжка «лодыжка на колене»

source: Anterior Tibialis-SMR
ru: Передняя большеберцовая — самомассаж

source: Anti-Gravity Press
ru: Жим «Антигравитация»

source: Arm Circles
ru: Круговые движения руками

source: Arnold Dumbbell Press
ru: Жим Арнольда

source: Around The Worlds
ru: Круги штангой «вокруг света»

source: Atlas Stone Trainer
ru: Тренажёр для атласных камней

source: Atlas Stones
ru: Атласные камни

source: Axle Deadlift
ru: Становая тяга с осью

source: Back Flyes - With Bands
ru: Разведение рук назад с резинкой

source: Backward Drag
ru: Тяга саней спиной вперёд

source: Backward Medicine Ball Throw
ru: Бросок медбола назад

source: Balance Board
ru: Балансировочная доска

source: Ball Leg Curl
ru: Сгибания ног на фитболе

source: Band Assisted Pull-Up
ru: Подтягивания с резинкой

source: Band Good Morning
ru: Наклоны с резинкой (гуд морнинг)

source: Band Good Morning (Pull Through)
ru: Наклоны с резинкой между ног (пулл-сру)

source: Band Hip Adductions
ru: Приведение бедра с резинкой

source: Band Pull Apart
ru: Разведение резинки перед собой

source: Band Skull Crusher
ru: Французский жим с резинкой

source: Barbell Ab Rollout
ru: Выкатывание штанги для пресса

source: Barbell Ab Rollout - On Knees
ru: Выкатывание штанги для пресса с колен

source: Barbell Bench Press - Medium Grip
ru: Жим штанги лёжа средним хватом

source: Barbell Curl
ru: Сгибания рук со штангой

source: Barbell Curls Lying Against An Incline
ru: Сгибания со штангой лёжа на наклонной скамье

source: Barbell Deadlift
ru: Становая тяга со штангой

source: Barbell Full Squat
ru: Глубокие приседания со штангой

source: Barbell Glute Bridge
ru: Ягодичный мостик со штангой

source: Barbell Guillotine Bench Press
ru: Жим штанги лёжа к шее («гильотина»)

source: Barbell Hack Squat
ru: Гакк-приседания со штангой

source: Barbell Hip Thrust
ru: Ягодичный мост со штангой от скамьи

source: Barbell Incline Bench Press - Medium Grip
ru: Жим штанги на наклонной скамье средним хватом

source: Barbell Incline Shoulder Raise
ru: Подъём плеч со штангой на наклонной скамье

source: Barbell Lunge
ru: Выпады со штангой

source: Barbell Rear Delt Row
ru: Тяга штанги к груди на задние дельты

source: Barbell Rollout from Bench
ru: Выкатывание штанги от скамьи

source: Barbell Seated Calf Raise
ru: Подъём на носки со штангой сидя

source: Barbell Shoulder Press
ru: Жим штанги стоя

source: Barbell Shrug
ru: Шраги со штангой

source: Barbell Shrug Behind The Back
ru: Шраги со штангой за спиной

source: Barbell Side Bend
ru: Наклоны в сторону со штангой

source: Barbell Side Split Squat
ru: Приседания в широкой стойке со штангой

source: Barbell Squat
ru: Приседания со штангой

source: Barbell Squat To A Bench
ru: Приседания со штангой до скамьи

source: Barbell Step Ups
ru: Зашагивания на платформу со штангой

source: Barbell Walking Lunge
ru: Выпады со штангой в движении

source: Battling Ropes
ru: Канаты (батл-роуп)

source: Bear Crawl Sled Drags
ru: Тяга саней на четвереньках («медвежья походка»)

source: Behind Head Chest Stretch
ru: Растяжка груди с руками за головой

source: Bench Dips
ru: Обратные отжимания от скамьи

source: Bench Jump
ru: Прыжки на скамью

source: Bench Press - Powerlifting
ru: Жим лёжа — пауэрлифтинг

source: Bench Press - With Bands
ru: Жим лёжа с резинками

source: Bench Press with Chains
ru: Жим лёжа с цепями

source: Bench Sprint
ru: Бег с упором на скамью

source: Bent-Arm Barbell Pullover
ru: Пуловер со штангой на согнутых руках

source: Bent-Arm Dumbbell Pullover
ru: Пуловер с гантелью на согнутых руках

source: Bent-Knee Hip Raise
ru: Подъём таза с согнутыми коленями

source: Bent Over Barbell Row
ru: Тяга штанги в наклоне

source: Bent Over Dumbbell Rear Delt Raise With Head On Bench
ru: Разведение гантелей в наклоне с опорой головой на скамью

source: Bent Over Low-Pulley Side Lateral
ru: Отведение руки в наклоне с нижнего блока

source: Bent Over One-Arm Long Bar Row
ru: Тяга Т-грифа одной рукой в наклоне

source: Bent Over Two-Arm Long Bar Row
ru: Тяга Т-грифа двумя руками в наклоне

source: Bent Over Two-Dumbbell Row
ru: Тяга двух гантелей в наклоне

source: Bent Over Two-Dumbbell Row With Palms In
ru: Тяга двух гантелей в наклоне нейтральным хватом

source: Bent Press
ru: Жим в наклоне (бент-пресс)

source: Bicycling
ru: Велосипед

source: Bicycling, Stationary
ru: Велотренажёр

source: Board Press
ru: Жим от досок

source: Body-Up
ru: Отжимания на трицепс с подъёмом корпуса

source: Body Tricep Press
ru: Жим на трицепс собственным весом

source: Bodyweight Flyes
ru: Разводка с собственным весом

source: Bodyweight Mid Row
ru: Горизонтальная тяга собственным весом

source: Bodyweight Squat
ru: Приседания без веса

source: Bodyweight Walking Lunge
ru: Выпады в движении без веса

source: Bosu Ball Cable Crunch With Side Bends
ru: Скручивания в кроссовере на BOSU с наклонами в сторону

source: Bottoms-Up Clean From The Hang Position
ru: Взятие гирь дном вверх с виса

source: Bottoms Up
ru: Подъём ног «дном вверх»

source: Box Jump (Multiple Response)
ru: Прыжки на тумбу (серия)

source: Box Skip
ru: Прыжки через скакалку на тумбу

source: Box Squat
ru: Приседания на тумбу

source: Box Squat with Bands
ru: Приседания на тумбу с резинками

source: Box Squat with Chains
ru: Приседания на тумбу с цепями

source: Brachialis-SMR
ru: Плечевая мышца — самомассаж

source: Bradford/Rocky Presses
ru: Жим Брэдфорда / Рокки

source: Butt-Ups
ru: Подъём таза вверх из планки

source: Butt Lift (Bridge)
ru: Ягодичный мостик

source: Butterfly
ru: Сведение рук в тренажёре (бабочка)

source: Cable Chest Press
ru: Жим от груди в кроссовере

source: Cable Crossover
ru: Сведение рук в кроссовере

source: Cable Crunch
ru: Скручивания на блоке

source: Cable Deadlifts
ru: Становая тяга на блоке

source: Cable Hammer Curls - Rope Attachment
ru: Сгибания «молот» на блоке с канатом

source: Cable Hip Adduction
ru: Приведение бедра на блоке

source: Cable Incline Pushdown
ru: Разгибания на трицепс на блоке на наклонной скамье

source: Cable Incline Triceps Extension
ru: Разгибания на трицепс с блока на наклонной скамье

source: Cable Internal Rotation
ru: Внутренняя ротация плеча на блоке

source: Cable Iron Cross
ru: «Железный крест» в кроссовере

source: Cable Judo Flip
ru: Бросок через бедро на блоке

source: Cable Lying Triceps Extension
ru: Разгибания на трицепс на блоке лёжа

source: Cable One Arm Tricep Extension
ru: Разгибание на трицепс одной рукой на блоке

source: Cable Preacher Curl
ru: Сгибания на скамье Скотта на блоке

source: Cable Rear Delt Fly
ru: Разведение на задние дельты в кроссовере

source: Cable Reverse Crunch
ru: Обратные скручивания на блоке

source: Cable Rope Overhead Triceps Extension
ru: Разгибания из-за головы с канатом на блоке

source: Cable Rope Rear-Delt Rows
ru: Тяга каната к лицу на задние дельты

source: Cable Russian Twists
ru: Русские скручивания на блоке

source: Cable Seated Crunch
ru: Скручивания на блоке сидя

source: Cable Seated Lateral Raise
ru: Махи в стороны на блоке сидя

source: Cable Shoulder Press
ru: Жим от плеч на блоке

source: Cable Shrugs
ru: Шраги на блоке

source: Cable Wrist Curl
ru: Сгибания запястий на блоке

source: Calf-Machine Shoulder Shrug
ru: Шраги в тренажёре для икр

source: Calf Press
ru: Жим носками

source: Calf Press On The Leg Press Machine
ru: Жим носками в тренажёре для жима ногами

source: Calf Raise On A Dumbbell
ru: Подъём на носки с гантели

source: Calf Raises - With Bands
ru: Подъём на носки с резинками

source: Calf Stretch Elbows Against Wall
ru: Растяжка икр с упором локтями в стену

source: Calf Stretch Hands Against Wall
ru: Растяжка икр с упором руками в стену

source: Calves-SMR
ru: Икры — самомассаж

source: Car Deadlift
ru: Становая тяга автомобиля

source: Car Drivers
ru: «Руль автомобиля» с блином

source: Carioca Quick Step
ru: Кариока — быстрые шаги

source: Cat Stretch
ru: Растяжка «кошка»

source: Catch and Overhead Throw
ru: Ловля и бросок из-за головы

source: Chain Handle Extension
ru: Разгибания с цепью

source: Chain Press
ru: Жим с цепями

source: Chair Leg Extended Stretch
ru: Растяжка ног на стуле

source: Chair Lower Back Stretch
ru: Растяжка поясницы на стуле

source: Chair Squat
ru: Приседания на стул

source: Chair Upper Body Stretch
ru: Растяжка верха тела на стуле

source: Chest And Front Of Shoulder Stretch
ru: Растяжка груди и передней дельты

source: Chest Push from 3 point stance
ru: Толчок от груди из трёхточечной стойки

source: Chest Push (multiple response)
ru: Толчок от груди (серия)

source: Chest Push (single response)
ru: Толчок от груди (одиночный)

source: Chest Push with Run Release
ru: Толчок от груди с ускорением

source: Chest Stretch on Stability Ball
ru: Растяжка груди на фитболе

source: Child's Pose
ru: Поза ребёнка

source: Chin-Up
ru: Подтягивания обратным хватом

source: Chin To Chest Stretch
ru: Растяжка «подбородок к груди»

source: Circus Bell
ru: Цирковая гантель

source: Clean
ru: Взятие на грудь

source: Clean Deadlift
ru: Становая тяга для взятия на грудь

source: Clean Pull
ru: Тяга для взятия на грудь

source: Clean Shrug
ru: Шраги для взятия на грудь

source: Clean and Jerk
ru: Толчок

source: Clean and Press
ru: Взятие на грудь и жим

source: Clean from Blocks
ru: Взятие на грудь с блоков

source: Clock Push-Up
ru: Отжимания «часы»

source: Close-Grip Barbell Bench Press
ru: Жим штанги лёжа узким хватом

source: Close-Grip Dumbbell Press
ru: Жим гантелей узким хватом

source: Close-Grip EZ-Bar Curl with Band
ru: Сгибания с EZ-грифом узким хватом с резинкой

source: Close-Grip EZ-Bar Press
ru: Жим EZ-грифа узким хватом

source: Close-Grip EZ Bar Curl
ru: Сгибания с EZ-грифом узким хватом

source: Close-Grip Front Lat Pulldown
ru: Тяга верхнего блока узким хватом

source: Close-Grip Push-Up off of a Dumbbell
ru: Отжимания узким хватом от гантели

source: Close-Grip Standing Barbell Curl
ru: Сгибания со штангой стоя узким хватом

source: Cocoons
ru: Коконы

source: Conan's Wheel
ru: Колесо Конана

source: Concentration Curls
ru: Концентрированные сгибания

source: Cross-Body Crunch
ru: Скручивания с перекрёстом

source: Cross Body Hammer Curl
ru: Сгибания «молот» к противоположному плечу

source: Cross Over - With Bands
ru: Сведение рук с резинками

source: Crossover Reverse Lunge
ru: Обратный выпад с перекрёстом

source: Crucifix
ru: Распятие

source: Crunch - Hands Overhead
ru: Скручивания с руками за головой

source: Crunch - Legs On Exercise Ball
ru: Скручивания с ногами на фитболе

source: Crunches
ru: Скручивания

source: Cuban Press
ru: Кубинский жим

source: Dancer's Stretch
ru: Растяжка танцора

source: Dead Bug
ru: «Мёртвый жук»

source: Deadlift with Bands
ru: Становая тяга с резинками

source: Deadlift with Chains
ru: Становая тяга с цепями

source: Decline Barbell Bench Press
ru: Жим штанги лёжа на скамье с обратным наклоном

source: Decline Close-Grip Bench To Skull Crusher
ru: Жим узким хватом с переходом во французский жим на скамье с обратным наклоном

source: Decline Crunch
ru: Скручивания на скамье с обратным наклоном

source: Decline Dumbbell Bench Press
ru: Жим гантелей на скамье с обратным наклоном

source: Decline Dumbbell Flyes
ru: Разводка гантелей на скамье с обратным наклоном

source: Decline Dumbbell Triceps Extension
ru: Разгибание гантели на трицепс на скамье с обратным наклоном

source: Decline EZ Bar Triceps Extension
ru: Французский жим с EZ-грифом на скамье с обратным наклоном

source: Decline Oblique Crunch
ru: Косые скручивания на скамье с обратным наклоном

source: Decline Push-Up
ru: Отжимания головой вниз

source: Decline Reverse Crunch
ru: Обратные скручивания на скамье с обратным наклоном

source: Decline Smith Press
ru: Жим в Смите на скамье с обратным наклоном

source: Deficit Deadlift
ru: Становая тяга с дефицитом

source: Depth Jump Leap
ru: Прыжок в глубину с отскоком

source: Dip Machine
ru: Отжимания на брусьях в тренажёре

source: Dips - Chest Version
ru: Отжимания на брусьях на грудь

source: Dips - Triceps Version
ru: Отжимания на брусьях на трицепс

source: Donkey Calf Raises
ru: Подъём на носки «ослик»

source: Double Kettlebell Alternating Hang Clean
ru: Попеременное взятие двух гирь с виса

source: Double Kettlebell Jerk
ru: Толчок двух гирь

source: Double Kettlebell Push Press
ru: Швунг двух гирь

source: Double Kettlebell Snatch
ru: Рывок двух гирь

source: Double Kettlebell Windmill
ru: Мельница с двумя гирями

source: Double Leg Butt Kick
ru: Захлёст голени двумя ногами

source: Downward Facing Balance
ru: Баланс с наклоном вниз

source: Drag Curl
ru: Сгибания «волоком»

source: Drop Push
ru: Толчок с падением

source: Dumbbell Alternate Bicep Curl
ru: Попеременные сгибания рук с гантелями

source: Dumbbell Bench Press
ru: Жим гантелей лёжа

source: Dumbbell Bench Press with Neutral Grip
ru: Жим гантелей лёжа нейтральным хватом

source: Dumbbell Bicep Curl
ru: Сгибания рук с гантелями

source: Dumbbell Clean
ru: Взятие гантелей на грудь

source: Dumbbell Floor Press
ru: Жим гантелей с пола

source: Dumbbell Flyes
ru: Разводка гантелей лёжа

source: Dumbbell Incline Row
ru: Тяга гантелей лёжа на наклонной скамье

source: Dumbbell Incline Shoulder Raise
ru: Подъём плеч с гантелями на наклонной скамье

source: Dumbbell Lunges
ru: Выпады с гантелями

source: Dumbbell Lying One-Arm Rear Lateral Raise
ru: Разведение одной гантели лёжа на боку на задние дельты

source: Dumbbell Lying Pronation
ru: Пронация с гантелью лёжа

source: Dumbbell Lying Rear Lateral Raise
ru: Разведение гантелей лёжа на задние дельты

source: Dumbbell Lying Supination
ru: Супинация с гантелью лёжа

source: Dumbbell One-Arm Shoulder Press
ru: Жим гантели одной рукой

source: Dumbbell One-Arm Triceps Extension
ru: Разгибание гантели одной рукой на трицепс

source: Dumbbell One-Arm Upright Row
ru: Тяга гантели к подбородку одной рукой

source: Dumbbell Prone Incline Curl
ru: Сгибания с гантелями лёжа на животе на наклонной скамье

source: Dumbbell Raise
ru: Подъём гантелей

source: Dumbbell Rear Lunge
ru: Обратные выпады с гантелями

source: Dumbbell Scaption
ru: Подъём гантелей в плоскости лопатки

source: Dumbbell Seated Box Jump
ru: Прыжки на тумбу из положения сидя с гантелями

source: Dumbbell Seated One-Leg Calf Raise
ru: Подъём на носок одной ноги с гантелью сидя

source: Dumbbell Shoulder Press
ru: Жим гантелей над головой

source: Dumbbell Shrug
ru: Шраги с гантелями

source: Dumbbell Side Bend
ru: Наклоны в сторону с гантелью

source: Dumbbell Squat
ru: Приседания с гантелями

source: Dumbbell Squat To A Bench
ru: Приседания с гантелями до скамьи

source: Dumbbell Step Ups
ru: Зашагивания на платформу с гантелями

source: Dumbbell Tricep Extension -Pronated Grip
ru: Разгибания с гантелями на трицепс прямым хватом

source: Dynamic Back Stretch
ru: Динамическая растяжка спины

source: Dynamic Chest Stretch
ru: Динамическая растяжка груди

source: EZ-Bar Curl
ru: Сгибания рук с EZ-грифом

source: EZ-Bar Skullcrusher
ru: Французский жим с EZ-грифом

source: Elbow Circles
ru: Вращения локтями

source: Elbow to Knee
ru: Локоть к колену

source: Elbows Back
ru: Сведение локтей назад

source: Elevated Back Lunge
ru: Обратные выпады с возвышения

source: Elevated Cable Rows
ru: Тяга нижнего блока с возвышения

source: Elliptical Trainer
ru: Эллиптический тренажёр

source: Exercise Ball Crunch
ru: Скручивания на фитболе

source: Exercise Ball Pull-In
ru: Подтягивание коленей на фитболе

source: Extended Range One-Arm Kettlebell Floor Press
ru: Жим гири с пола одной рукой с увеличенной амплитудой

source: External Rotation
ru: Наружная ротация плеча

source: External Rotation with Band
ru: Наружная ротация плеча с резинкой

source: External Rotation with Cable
ru: Наружная ротация плеча на блоке

source: Face Pull
ru: Тяга каната к лицу

source: Farmer's Walk
ru: Прогулка фермера

source: Fast Skipping
ru: Быстрые подскоки

source: Finger Curls
ru: Сгибания пальцев

source: Flat Bench Cable Flyes
ru: Разводка в кроссовере на горизонтальной скамье

source: Flat Bench Leg Pull-In
ru: Подтягивание ног к груди на скамье

source: Flat Bench Lying Leg Raise
ru: Подъём ног лёжа на скамье

source: Flexor Incline Dumbbell Curls
ru: Сгибания с гантелями на наклонной скамье на сгибатели

source: Floor Glute-Ham Raise
ru: Подъём корпуса на бицепс бедра с пола

source: Floor Press
ru: Жим штанги с пола

source: Floor Press with Chains
ru: Жим с пола с цепями

source: Flutter Kicks
ru: Ножницы (махи ногами)

source: Foot-SMR
ru: Стопа — самомассаж

source: Forward Drag with Press
ru: Тяга саней вперёд с жимом

source: Frankenstein Squat
ru: Приседания «Франкенштейн»

source: Freehand Jump Squat
ru: Приседания с выпрыгиванием без веса

source: Frog Hops
ru: Прыжки лягушкой

source: Frog Sit-Ups
ru: Подъём корпуса «лягушка»

source: Front Barbell Squat
ru: Фронтальные приседания со штангой

source: Front Barbell Squat To A Bench
ru: Фронтальные приседания со штангой до скамьи

source: Front Box Jump
ru: Прыжок на тумбу вперёд

source: Front Cable Raise
ru: Подъём руки перед собой на блоке

source: Front Cone Hops (or hurdle hops)
ru: Прыжки через конусы (или барьеры) вперёд

source: Front Dumbbell Raise
ru: Подъём гантели перед собой

source: Front Incline Dumbbell Raise
ru: Подъём гантелей перед собой на наклонной скамье

source: Front Leg Raises
ru: Махи ногами вперёд

source: Front Plate Raise
ru: Подъём блина перед собой

source: Front Raise And Pullover
ru: Подъём перед собой с пуловером

source: Front Squat (Clean Grip)
ru: Фронтальные приседания (хват как при взятии на грудь)

source: Front Squats With Two Kettlebells
ru: Фронтальные приседания с двумя гирями

source: Front Two-Dumbbell Raise
ru: Подъём двух гантелей перед собой

source: Full Range-Of-Motion Lat Pulldown
ru: Тяга верхнего блока с полной амплитудой

source: Gironda Sternum Chins
ru: Подтягивания Жиронды к грудине

source: Glute Ham Raise
ru: Подъём на бицепс бедра (glute-ham raise)

source: Glute Kickback
ru: Отведение ноги назад

source: Goblet Squat
ru: Кубковые приседания

source: Good Morning
ru: Наклоны со штангой (гуд морнинг)

source: Good Morning off Pins
ru: Наклоны со штангой от упоров

source: Gorilla Chin/Crunch
ru: Подтягивания со скручиванием «горилла»

source: Groin and Back Stretch
ru: Растяжка паха и спины

source: Groiners
ru: Шаги к рукам из планки (грайнеры)

source: Hack Squat
ru: Гакк-приседания

source: Hammer Curls
ru: Сгибания «молот»

source: Hammer Grip Incline DB Bench Press
ru: Жим гантелей на наклонной скамье нейтральным хватом

source: Hamstring-SMR
ru: Бицепс бедра — самомассаж

source: Hamstring Stretch
ru: Растяжка бицепса бедра

source: Handstand Push-Ups
ru: Отжимания в стойке на руках

source: Hang Clean
ru: Взятие на грудь с виса

source: Hang Clean - Below the Knees
ru: Взятие на грудь с виса ниже колен

source: Hang Snatch
ru: Рывок с виса

source: Hang Snatch - Below Knees
ru: Рывок с виса ниже колен

source: Hanging Bar Good Morning
ru: Наклоны со штангой в висе

source: Hanging Leg Raise
ru: Подъём ног в висе

source: Hanging Pike
ru: Подъём прямых ног в висе («складка»)

source: Heaving Snatch Balance
ru: Уход в сед со штангой над головой с подседом

source: Heavy Bag Thrust
ru: Толчок боксёрского мешка

source: High Cable Curls
ru: Сгибания рук на верхнем блоке

source: Hip Circles (prone)
ru: Вращения бёдрами лёжа

source: Hip Extension with Bands
ru: Разгибание бедра с резинками

source: Hip Flexion with Band
ru: Сгибание бедра с резинкой

source: Hip Lift with Band
ru: Подъём таза с резинкой

source: Hug A Ball
ru: Обхват мяча

source: Hug Knees To Chest
ru: Подтягивание коленей к груди

source: Hurdle Hops
ru: Прыжки через барьеры

source: Hyperextensions (Back Extensions)
ru: Гиперэкстензия

source: Hyperextensions With No Hyperextension Bench
ru: Гиперэкстензия без тренажёра

source: IT Band and Glute Stretch
ru: Растяжка ИТ-тракта и ягодиц

source: Iliotibial Tract-SMR
ru: Илиотибиальный тракт — самомассаж

source: Inchworm
ru: Гусеница

source: Incline Barbell Triceps Extension
ru: Разгибания со штангой на трицепс на наклонной скамье

source: Incline Bench Pull
ru: Тяга лёжа на наклонной скамье

source: Incline Cable Chest Press
ru: Жим от груди в кроссовере на наклонной скамье

source: Incline Cable Flye
ru: Разводка в кроссовере на наклонной скамье

source: Incline Dumbbell Bench With Palms Facing In
ru: Жим гантелей на наклонной скамье нейтральным хватом (ладони внутрь)

source: Incline Dumbbell Curl
ru: Сгибания с гантелями на наклонной скамье

source: Incline Dumbbell Flyes
ru: Разводка гантелей на наклонной скамье

source: Incline Dumbbell Flyes - With A Twist
ru: Разводка гантелей на наклонной скамье с разворотом

source: Incline Dumbbell Press
ru: Жим гантелей на наклонной скамье

source: Incline Hammer Curls
ru: Сгибания «молот» на наклонной скамье

source: Incline Inner Biceps Curl
ru: Сгибания на наклонной скамье с разведением рук

source: Incline Push-Up
ru: Отжимания с руками на возвышении

source: Incline Push-Up Close-Grip
ru: Отжимания с руками на возвышении узким хватом

source: Incline Push-Up Depth Jump
ru: Отжимания с руками на возвышении с прыжком в глубину

source: Incline Push-Up Medium
ru: Отжимания с руками на возвышении средним хватом

source: Incline Push-Up Reverse Grip
ru: Отжимания с руками на возвышении обратным хватом

source: Incline Push-Up Wide
ru: Отжимания с руками на возвышении широким хватом

source: Intermediate Groin Stretch
ru: Растяжка паха, средний уровень

source: Intermediate Hip Flexor and Quad Stretch
ru: Растяжка сгибателей бедра и квадрицепса, средний уровень

source: Internal Rotation with Band
ru: Внутренняя ротация плеча с резинкой

source: Inverted Row
ru: Горизонтальные подтягивания

source: Inverted Row with Straps
ru: Горизонтальные подтягивания на петлях

source: Iron Cross
ru: Железный крест

source: Iron Crosses (stretch)
ru: Железный крест (растяжка)

source: Isometric Chest Squeezes
ru: Изометрическое сжатие ладоней перед грудью

source: Isometric Neck Exercise - Front And Back
ru: Изометрия для шеи — вперёд и назад

source: Isometric Neck Exercise - Sides
ru: Изометрия для шеи — в стороны

source: Isometric Wipers
ru: Изометрические «дворники»

source: JM Press
ru: Жим JM

source: Jackknife Sit-Up
ru: Складка

source: Janda Sit-Up
ru: Подъём корпуса по Янде

source: Jefferson Squats
ru: Приседания Джефферсона

source: Jerk Balance
ru: Уход в ножницы со штангой над головой

source: Jerk Dip Squat
ru: Подсед для толчка

source: Jogging, Treadmill
ru: Бег на беговой дорожке
